<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [	
    '[hello]'  => [
        ':id'  => ['index/hello', ['method' => 'get'], ['id' => '\d+']],  //局部配置id的参数类型
        ':name' => ['index/hello', ['method' => 'post']]
    ],
    '__pattern__' => [   //全局配置name的参数类型
        'name' => '\w+',
    ]
];